bp3.OneSniffer/src/InformationRegisters/ЛогиТрафика/ЛогиТрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогиТрафика</name>
  <resources>
    <name>Метод</name>
    <type>
      <types>EnumRef.МетодHTTP</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Содержание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Разделитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяНачала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

bp3.OneSniffer/src/CommonModules/_HTTPСервис/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

// Конструктор структуры лога входящего HTTP-запроса (без записи в РС/ЖР).
//
// Параметры:
//  Запрос - HTTPСервисЗапрос
//  ИмяСобытия - Строка - необязательное имя для группировки в списке логов
//
// Возвращаемое значение:
//  Структура - см. РегистрыСведений.ЛогиТрафика.НовыйЛогЗапроса; Входящий = Истина
//
Функция НовыйЛогВходящегоЗапроса(Знач Запрос, ИмяСобытия = "") Экспорт
	
	Возврат РегистрыСведений.ЛогиТрафика.НовыйЛогВходящегоЗапроса(Запрос, ИмяСобытия);
	
КонецФункции

// Записывает лог входящего HTTP-запроса в РС и/или ЖР по настройкам (аналог завершения _ВызватьHTTPМетод).
//
// Параметры:
//  ЛогЗапроса - см. НовыйЛогВходящегоЗапроса
//  Ответ - HTTPСервисОтвет - при успешной обработке; при исключении не передаётся
//  ИнформацияОбОшибке - ИнформацияОбОшибке - при исключении в обработчике; иначе не передаётся
//
Процедура ЗаписатьВходящийЛог(Знач ЛогЗапроса, Знач Ответ = Неопределено, ИнформацияОбОшибке = Неопределено) Экспорт
	
	НастройкиЛогирования = ЛогированиеТрафика.ЗагрузитьНастройкиЛогирования();
	Если Не НастройкиЛогирования.ВключеноЛогирование Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоИсключение = (ИнформацияОбОшибке <> Неопределено);
	Если Не ЭтоИсключение И Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляЗаписи = ЛогированиеТрафика.ДанныеДляЗаписиИсключения(ЛогЗапроса);
	ТекстОшибки = "";
	
	Если ЭтоИсключение Тогда
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Если ЛогированиеТрафика.ЗаписыватьТелоВРС() Тогда
			ЛогЗапроса.Содержание.ТелоОтвета = ТекстОшибки;
		КонецЕсли;
		ЛогЗапроса.КодОтвета = 0;
		
		ЗаписьЖурналаРегистрации(
			ЛогированиеТрафика.СобытиеОбработатьHTTPСервис(),
			УровеньЖурналаРегистрации.Ошибка,,
			ДанныеДляЗаписи,
			ТекстОшибки);
		
		Если Не ТранзакцияАктивна()
			И НастройкиЛогирования.ЗаписыватьВРС Тогда
			РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса, , ТекстОшибки);
		КонецЕсли;
		
	Иначе
		
		ЛогЗапроса.КодОтвета = Ответ.КодСостояния;
		ЛогЗапроса.Содержание.ЗаголовкиОтвета = Ответ.Заголовки;
		Если ЛогированиеТрафика.ЗаписыватьТелоВРС() Или ЛогированиеТрафика.ЗаписыватьТелоВЖР() Тогда
			ЛогЗапроса.Содержание.ТелоОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
		КонецЕсли;
		
		Если НастройкиЛогирования.ЗаписыватьВЖР Тогда
			
			КомментарийЖурнала = ЛогированиеТрафика.КомментарийЗаписиЖурналаHTTP(ЛогЗапроса);
			ЗаписьЖурналаРегистрации(
				ЛогированиеТрафика.СобытиеОбработатьHTTPСервис(),
				УровеньЖурналаРегистрации.Информация,,
				ДанныеДляЗаписи,
				КомментарийЖурнала);
			
		КонецЕсли;
		
		Если НастройкиЛогирования.ЗаписыватьВРС Тогда
			РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
